AM-XML-Beispiele/seekOrder_Request_SOAP.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
	<soap:Header>
		<wsse:Security soap:mustUnderstand="1">
			<wsse:UsernameToken xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="SecurityToken-115b71ae-7ae2-47c6-a1cd-87c540312330">
				<wsse:Username>ws_am_user</wsse:Username>
				<wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">XYZ</wsse:Password>
			</wsse:UsernameToken>
		</wsse:Security>
	</soap:Header>
	<soap:Body>
		<n:Request xmlns:n="urn:www-deutschepost-de:OrderManagement/CertificationOrderManagement/4.4/seekOrderRequest" xmlns:om="urn:www-deutschepost-de:OrderManagement/CertificationOrderManagement/4.4/common" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="urn:www-deutschepost-de:OrderManagement/CertificationOrderManagement/4.4/seekOrderRequest   O:/Realisierung/AM.exchange/AM-XML-Schemas_Zert/seekOrderRequest.xsd">
			<seekOrderRequest codeTableVersion="1.0" testcase="true" version="1.0">
				<MsgHeader>
					<User>muster01</User>
					<Password>H4juk9</Password>
					<MsgID>061112102356A00000001</MsgID>
					<CreationDateTime>2007-01-04T08:00:00</CreationDateTime>
					<Receiver>DPAG</Receiver>
					<SubmitterSMS>
						<CustID>6000000121</CustID>
					</SubmitterSMS>
					<Origin>
						<SystemName>A-AS1</SystemName>
						<SystemVersion>1.3</SystemVersion>
						<CertificationDate>2006-09-29</CertificationDate>
					</Origin>
				</MsgHeader>
				<Parties>
					<Originator>
						<CustID>6000000121</CustID>
					</Originator>
				</Parties>
				<Induction>
					<EarliestDateTime>2006-12-25T10:00:00</EarliestDateTime>
					<LatestDateTime>2007-01-06T10:00:00</LatestDateTime>
				</Induction>
			</seekOrderRequest>
		</n:Request>
	</soap:Body>
</soap:Envelope>
